report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 386.9,
    "medianResTime" : 367.0,
    "minResTime" : 343.0,
    "maxResTime" : 781.0,
    "pct1ResTime" : 402.1,
    "pct2ResTime" : 762.0999999999997,
    "pct3ResTime" : 781.0,
    "throughput" : 0.21002446785050458,
    "receivedKBytesPerSec" : 0.14664794386045973,
    "sentKBytesPerSec" : 0.042866322051519
  },
  "HTTP Request" : {
    "transaction" : "HTTP Request",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 386.9,
    "medianResTime" : 367.0,
    "minResTime" : 343.0,
    "maxResTime" : 781.0,
    "pct1ResTime" : 402.1,
    "pct2ResTime" : 762.0999999999997,
    "pct3ResTime" : 781.0,
    "throughput" : 0.21002446785050458,
    "receivedKBytesPerSec" : 0.14664794386045973,
    "sentKBytesPerSec" : 0.042866322051519
  }
}